tsung_tests/simple_cart.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/opt/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true"/>
  </clients>
  
  <!-- Server side setup -->
<servers>
  <server host="52.91.203.252" port="8000" type="tcp"></server>
</servers>

  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>
  </load>

  <options>
   <option type="ts_http" name="user_agent">
    <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
    <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
   </option>
  </options>

   <sessions>
        <session name='login_cart_logout' probability='100'  type='ts_http'>
        <request><http url='http://54.86.31.175/login' version='1.1' method='GET'></http></request>

        <thinktime random='true' value='5'/>

        <request><http url='/assets/application-85f3e37588d64cdc8817d7a50fc3c1d80f51f2e0f103d0a60a467698fe9a7f28.css' version='1.1' method='GET'></http></request>
        <request><http url='/css/index.css' version='1.1' method='GET'></http></request>
        <request><http url='/assets/application-d3b407e8dc3d82934fb3d97690e3ef706d4d51c4871524fbc3f9fd4dbd1a731c.js' version='1.1' method='GET'></http></request>
        <request><http url='/favicon.png' version='1.1' method='GET'></http></request>

        <thinktime random='true' value='11'/>

      <request>
        <dyn_variable name="authenticity_token" ></dyn_variable> 
        <http url='/login' version='1.1' method='GET'></http>
      </request>
    

      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="num" />
      </setdynvars>

        <request subst="true">
            <http url='/login' version='1.1'  contents='utf8=%E2%9C%93&amp;authenticity_token=%%_authenticity_token%%&amp;session%5Bemail%5D=user%%_num%%%40gmail.com&amp;session%5Bpassword%5D=123456&amp;commit=Log+in' content_type='application/x-www-form-urlencoded' method='POST'>
            </http>
        </request>

      <request><http url='/products' version='1.1' method='GET'></http></request>

      <thinktime random='true' value='1'/>

      <request><http url='/css/star-rating.min.css' version='1.1' method='GET'></http></request>
      <request><http url='/scripts/star-rating.min.js' version='1.1' method='GET'></http></request>
      <request><http url='http://ecx.images-amazon.com/images/I/51Cbw%2Bgj%2BbL.jpg' version='1.1' method='GET'></http></request>
      <request><http url='/images/I/31CwengVeiL.jpg' version='1.1' method='GET'></http></request>
      <request><http url='/images/I/61dV46aLrFL.png' version='1.1' method='GET'></http></request>
      <request><http url='/images/I/41LV-imrfiL.jpg' version='1.1' method='GET'></http></request>
      <request><http url='/images/I/51ST-umcgwL.png' version='1.1' method='GET'></http></request>
      <request><http url='/images/I/51kerlbmghL.jpg' version='1.1' method='GET'></http></request>
      <request><http url='/images/I/51eO3lhljNL.jpg' version='1.1' method='GET'></http></request>
      <request><http url='/images/I/612O2jTuEuL.jpg' version='1.1' method='GET'></http></request>
      <request><http url='/images/I/5181xTWzcrL.jpg' version='1.1' method='GET'></http></request>
      <request><http url='/images/I/61XTTqRBYlL.jpg' version='1.1' method='GET'></http></request>

      <thinktime random='true' value='6'/>

      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="product_num" />
      </setdynvars>

      <request subst="true">
        <http url='http://54.86.31.175/line_items?product_id=%%_product_num%%' version='1.1'  contents='_method=post&amp;authenticity_token=%%_authenticity_token%%' content_type='application/x-www-form-urlencoded' method='POST'>
        </http>
      </request>
      <request><http url='/carts/1/init' version='1.1' method='GET'></http></request>
      <request><http url='/carts/1/time_sort' version='1.1' method='GET'></http></request>
      <request><http url='/carts/1' version='1.1' method='GET'></http></request>

      <thinktime random='true' value='4'/>
      
      <request subst="true">
        <http url='/line_items/1' version='1.1'  contents='_method=delete&amp;authenticity_token=%%_authenticity_token%%' content_type='application/x-www-form-urlencoded' method='POST'></http>
      </request>
      <request><http url='/carts/1/init' version='1.1' method='GET'></http></request>
      <request><http url='/carts/1/time_sort' version='1.1' method='GET'></http></request>
      <request><http url='/carts/1' version='1.1' method='GET'></http></request>

      <thinktime random='true' value='6'/>

      <request subst="true"><http url='/logout' version='1.1'  contents='_method=delete&amp;authenticity_token=%%_authenticity_token%%' content_type='application/x-www-form-urlencoded' method='POST'></http></request>
      <request><http url='/products' version='1.1' method='GET'></http></request>
      <request><http url='/login' version='1.1' method='GET'></http></request>


      </session>

	</sessions>
</tsung>